:PROPERTIES:
:ID: c9170c1c-8297-4401-b093-12a01d9ae742
:END:
#+title: Help
#+description: Help
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:general:
#+created: 2026-05-21
#+updated: 2026-05-21

#+begin_src sh :noweb yes :results output  :wrap example
./ores.shell ${log_args} --help
#+end_src

#+RESULTS:
#+begin_example
ORE Studio Shell is an interactive REPL for ORE Studio.
It provides a command-line interface for connecting to and interacting with ores.comms.service.

Usage: ores.shell [options]


General:
  -h [ --help ]                         Display usage and exit.
  -v [ --version ]                      Output version information and exit.

Logging:
  -e [ --log-enabled ]                  Generate a log file.
  -l [ --log-level ] arg (=info)        What level to use for logging. Valid
                                        values: trace, debug, info, warn,
                                        error.
  --log-to-console                      Output logging to the console, as well
                                        as to file.
  --log-directory arg (=log)            Where to place the log files.
  --log-filename arg (=ores.shell.log)
                                        Name of the log file.
  --log-include-pid                     Include process ID in log filename
                                        (e.g., app.12345.log).

Telemetry:
  --telemetry-enabled                   Enable telemetry export. When enabled,
                                        all log records are exported to a JSON
                                        Lines file for log aggregation.
  --telemetry-service-name arg (=ores-shell)
                                        Name of the service producing
                                        telemetry. Used as service.name in
                                        resource attributes.
  --telemetry-service-version arg (=0.0.11)
                                        Version of the service producing
                                        telemetry. Used as service.version in
                                        resource attributes.
  --telemetry-output-file arg (=telemetry.jsonl)
                                        Name of the telemetry output file (JSON
                                        Lines format).
  --telemetry-output-directory arg (=log)
                                        Directory in which to place the
                                        telemetry output file.
  --telemetry-streaming-enabled         Enable streaming of log records to the
                                        server. When enabled, log records are
                                        batched and sent to the connected
                                        server.
  --telemetry-batch-size arg (=50)      Number of records to batch before
                                        sending to the server.
  --telemetry-flush-interval arg (=5)   Maximum seconds to wait before flushing
                                        a partial batch.

Connection:
  --connect-host arg                    Host to connect to (e.g., localhost)
  --connect-port arg                    Port to connect to (e.g., 55555)
  --connect-identifier arg              Client identifier to use when
                                        connecting

Login:
  --login-username arg                  Username for authentication
  --login-password arg                  Password for authentication

#+end_example
